Tekla.Structures.Analysis.AnalysisPartAreaAttributes
The AnalysisPartAreaAttributes class contains information related to analysis part area attributes.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._AreaElementType
The area element type of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._AreaRotationXY
The area rotation XY of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._AreaElementSizeX
The area element size X of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._AreaElementSizeY
The area element size Y of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._AreaElementSizeHoles
The area element size holes of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._AreaStartNumber
The area start number.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._UseSimpleArea
This indicates whether simple areas are being used.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._MinimumAreaHoleSize
The minimum area hole size.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._AreaSupportType
The new area support of the analysis part.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes._RigidDiaphragmFilterName
The filter name of the rigid diaphragm.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaElementType
Gets or sets the area element type.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaElementSizeX
Gets or sets the area element size X.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaElementSizeY
Gets or sets the area element size Y.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaElementSizeHoles
Gets or sets the area element size holes.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaRotationXY
Gets or sets the area rotation XY.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupport
Gets or sets the area support.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportType
Gets or sets the area support type.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaStartNumber
Gets or sets the start number of the area.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.UseSimpleArea
Gets or sets a value indicating whether simple areas are used.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.MinimumAreaHoleSize
Gets or sets the minimum area hole size.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.RigidDiaphragmFilterName
Gets or sets the filter name of the rigid diaphragm.